<!-- dflook/terraform-github-actions {"workspace":"default","backend":"9f854b1c83f5e55f989d3bdd8a892d9116549d964f272277addc87bb783e6647","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","plan_job_ref":"Job Test plan target and replace #243 at https://github.com/dflook/terraform-github-actions/actions/runs/3104006119","plan_hash":"581360b34566e465bd73e3ffc9aba911cf1897acdba27053796e36d4b856163e","plan_text_format":"text"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "Lb5OvPAebl" -> (known after apply)
  ~ foreach = "xxz481012m" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #243](https://github.com/dflook/terraform-github-actions/actions/runs/3104006119)